cask_args appdir: '/Applications'

tap 'homebrew/services'
tap 'homebrew/science'
tap 'neovim/neovim'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'neovim/neovim'

brew 'mas'

mas 'Xcode', id: 497799835
mas 'Telegram Desktop', id: 946399090
mas 'Evernote', id: 406056744
mas 'Keynote', id: 409183694
mas 'xDiagram', id: 517581636
mas 'LimeChat', id: 414030210
mas 'iPhoto', id: 408981381
mas 'TweetDeck', id: 485812721
mas 'Twitter', id: 409789998
mas 'Pixelmator', id: 407963104
mas 'Sparrow', id: 417250177
mas '1Password', id: 443987910
mas 'Space Gremlin', id: 414515628
mas 'GarageBand', id: 682658836
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Deckset', id: 847496013
mas 'iMovie', id: 408981434
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Pocket', id: 568494494

brew 'vim', args: ['with-override-system-vi']
brew 'the_silver_searcher'
brew 'postgresql'
brew 'redis'
brew 'hub'
brew 'ack'
brew 'openssl'
brew 'ansible'
brew 'awscli'
brew 'bazaar'
brew 'boost'
brew 'cmake'
brew 'ctags'
brew 'dos2unix'
brew 'erlang'
brew 'elixir'
brew 'pcre'
brew 'go'
brew 'glide'
brew 'gnupg'
brew 'gnupg2'
brew 'graphviz'
brew 'haproxy'
brew 'hugo'
brew 'iftop'
brew 'jq'
brew 'mercurial'
brew 'mpssh'
brew 'nmap'
brew 'packer'
brew 'pwgen'
brew 'tree'
brew 'pass'
brew 'pkg-config'
brew 'qemu'
brew 'qt'
brew 's3cmd'
brew 'ssh-copy-id'
brew 'terraform'
brew 'wget'
brew 'fltk'
brew 'octave'
brew 'gnuplot', args: ['with-qt5', 'with-x11']
brew 'numpy'
brew 'scipy'
brew 'opencv'

cask 'cloud'
cask 'flux'
cask 'github-desktop'
cask 'slack'
cask 'sublime-text'
cask 'alfred'
cask 'virtualbox'
cask 'vagrant'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'sequel-pro'
cask 'vlc'
cask 'spectacle'
cask 'docker-toolbox'
cask 'iterm2'
cask 'libreoffice'
cask 'dash'
cask 'kitematic'
cask 'xquartz'
cask 'rstudio'
cask 'rescuetime'
cask 'skype'
cask 'spotify'
cask 'utorrent'
cask 'whatsapp'
cask 'wireshark'
cask 'zoomus'
